def area(a, h): 
    '''
    Возвращает площадь треугольника со стороной a и высотой h, проведённой к этой стороне
    
    Параметры:
        a(double): сторона
        h(double): высота

    Возвращаемое значение:
        S(double): площадь треугольника
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Периметр треугольника со сторонами a, b, c

    Параметры:
        a(double): сторона треугольника
        b(double): сторона треугольника
        c(double): сторона треугольника
    
    Возвращаемое значение:
        P(double): периметр треугольника
    '''
    return a + b + c 
